//task 1
// Назва JavaScript
// важливість: 2
// Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript ?’

// Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте ? ECMAScript!”


/*
let company = prompt('Яка офіційна назва JavaScript?', '');

if (company == 'ECMAScript') {
    alert('Правильно!');
} else {
    alert('Ви не знаєте? ECMAScript!');
}
*/


/*task 2
 Покажіть знак
 важливість: 2
 Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:

 1, якщо значення більше нуля,
    -1, якщо менше нуля,
        0, якщо дорівнює нулю.
 У цьому завданні ми припускаємо, що введене значення завжди є числом.

let anyNumber = prompt('Введіть будь-яке число', '');

if (anyNumber < 0) {
    alert(-1);
} else if (anyNumber == 0) {
    alert(0);
} else {
    alert(1);
}
*/




//task 3
/*
Перепишіть 'if' на '?'
важливість: 5
Перепишіть конструкцію if, використовуючи умовний оператор '?':

let result;

if (a + b < 4) {
  result = 'Нижче';
} else {
  result = 'Вище';
}

let result = (a + b < 4) ? 'Нижче' : 'Вище';
*/

/*
task 4
Перепишіть 'if..else' на '?'
важливість: 5
Перепишіть if..else, використовуючи декілька тернарних операторів '?'.

Для зручності читання рекомендується розділити код на кілька рядків.

let message;

if (login == 'Працівник') {
    message = 'Привіт';
} else if (login == 'Директор') {
    message = 'Вітаю';
} else if (login == '') {
    message = 'Немає логіну';
} else {
    message = '';
}

let message = (login == 'Працівник') ? 'Привіт' :
    (login == 'Директор') ? 'Вітаю' :
        (login == '') ? 'Немає логіну' :
            '';

*/