// let hour = prompt('Яка зараз година?');
// let minute = prompt('Скільки зараз хвилин?');

// if (hour && minute) {
//     alert(`Час: ${hour}:${minute}`);
// }


/*
Який результат АБО?
важливість: 5
Що виведе код нижче? 2

alert( null || 2 || undefined );

*/

/*
Який результат alerts, об'єднаних АБО?
важливість: 3
Що виведе код нижче? 1 2

alert( alert(1) || 2 || alert(3) );
*/

/*
Який результат І?
важливість: 5
Що виведе код нижче? null

alert( 1 && null && 2 );
*/

/*
Який результат alerts, об'єднаних за допомогою І?
важливість: 3
Що виведе код нижче?

alert( alert(1) && alert(2) );
*/

/*
Відповідь: 3.

alert( null || 2 && 3 || 4 );
Пріоритет І && вище за ||, тому він виконується першим.

Результат 2 && 3 = 3, тому вираз стає:

null || 3 || 4
Тепер результат — перше правдиве значення: 3.
*/

/*
Перевірте діапазон
важливість: 3
Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно.

“Включно” означає, що age може досягати країв 14 або 90.
*/

// let age = prompt('Скільки років?');
// if (age >= 14 && age <= 90) {
//     alert('вік в діапазоні');
// } else {
//     alert('вік Не в діапазоні');
// }


// let age = prompt('Скільки років?');
// if (!(age >= 14 && age <= 90)) {
//     alert('вік в діапазоні');
// } else {
//     alert('вік Не в діапазоні');
// }


// let result;
// if (result = (-1 || 0)) {
//     alert(result);
// }

// let result;
// if (result = (-1 && 0)) {
//     alert(result);
// }

// if (null || -1 && 1) alert('третій');

/*
Перевірте логін
важливість: 3
Напишіть код, який запитує логін за допомогою prompt.

Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль.Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.

Пароль перевіряється наступним чином:

Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
Інший рядок – покажіть “Неправильний пароль”,
Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
*/

let login = prompt('Хто там?:', '');

if (login === 'Admin') {
    let password = prompt('Password?', '');
    if (password === 'TheMaster') {
        alert('Welcome!');
    } else if (password === '' || password === null) {
        alert('Canceled');
    } else {
        alert('Wrong password')
    }
} else if (login === '' || login === null) {
    alert('canceled');
} else {
    alert('I dont know you');
}

