// let i = 0;
// while (i < 3) { // показується 0, далі 1, потім 2
//     alert(i);
//     i++;
// }

// ----------------------------------------------------------------


// let sum = 0;
// while (true) {
//     let value = +prompt("Введіть число", '');
//     if (!value) break; // (*)
//     sum += value;
// }
// alert('Сума: ' + sum);

// ----------------------------------------------------------------


// let i = 3;
// while (i) {
//     alert(i--);
// }
// ----------------------------------------------------------------

// let i = 0;
// while (++i < 5) alert(i);

// let i = 0;
// while (i++ < 5) alert(i);
// ----------------------------------------------------------------

// for (let i = 0; i < 5; i++) alert(i);

// for (let i = 0; i < 5; ++i) alert(i);

// ----------------------------------------------------------------

/*
Виведіть парні числа
важливість: 5
Виведіть парні числа від 2 до 10, використовуючи цикл for.
*/

//моє рішення
// for (i = 2; i <= 10; i++) {
//     if (i % 2 == 0) {
//         alert(i);
//     }
// }

/**
 * рішення
 * for (let i = 2; i <= 10; i++) {
  if (i % 2 == 0) {
    alert( i );
  }
}
 */

/**
 * Замініть цикл "for" на "while"
важливість: 5
Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).

for (let i = 0; i < 3; i++) {
  alert( `число ${i}!` );
}
   */

// let i = 0;
// while (i < 3) {
//     alert(`число ${i}!`);
//     i++;
// }

/*
Повторяти цикл, доки ввід невірний
важливість: 5
Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.

Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.

Ми припускаємо, що відвідувач вводитиме лише числа. В цьому завданні не обов’язково реалізовувати оброблення нечислового введення.
*/

// let number;

// do {
//   number = prompt('Введіть число більше за 100', '')
//   alert(`Введене число: ${number}`);
// } while (number <= 100 && number);

// let n = 10;

// nextPrime:
// for (let i = 2; i <= n; i++) { // для кожного i...

//   for (let j = 2; j < i; j++) { // шукаємо дільник..
//     if (i % j == 0) continue nextPrime; // не просте, беремо наступне i
//   }

//   alert(i); // просте число
// }