// Постфіксна та префіксна форми
// важливість: 5
// Які кінцеві значення всіх змінних a, b, c та d після виконання коду нижче ?
let a = 1, b = 1;
let c = ++a; // ? 2
let d = b++; // ? 1

alert(`операнд c = ${c}`);
alert(typeof c);
alert(`операнд d = ${d}`);
alert(typeof d);

// Які значення мають a та x після виконання коду нижче?
let q = 2; // 2
let w = 1 + (q *= 2); // 5 and 4

// Які результати цих виразів?
"" + 1 + 0 // 10
"" - 1 + 0 // -1
true + false // 
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" // 9 + "px"
"$" + 4 + 5 // "$45"
"4" - 2 // 2
"4px" - 2 // NaN
"  -9  " + 5 // -9 5
"  -9  " - 5 // -14
null + 1 // 1
undefined + 1 // NaN
" \t \n" - 2 // -2

// Виправте додавання
// важливість: 5
// Нижче наведено код, що просить користувача ввести два числа і відображає їхню суму.
// Він працює неправильно.Код у прикладі виводить 12(для початкових значень у полях вводу).
// У чому помилка ? Виправте її.Результат має бути 3.

let x = prompt("Перше число?", 1);
let y = prompt("Друге число?", 2);
alert(+x + +y); // 12

//alert конвертує значення операнд в рядок, потрібно унарним оператором плюс конвертувати в числа, тоді бінарний оператор плюс буде
//сумувати числа, а не виконувати конкатенацію рядків